InformationRegisters/ОдноразовыеПароли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОдноразовыеПароли</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОдноразовыйПароль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияНаСнятиеПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНаСнятиеПоказанийПриборовУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраничнаяДатаСъема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымиУстройствами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОбменДаннымиМобПриложениеСервер/Ext/Module.bsl
Процедура РазрешитьОбмен(СтруктураОтвета, УзелУстройства, ВерсияПриложения) Экспорт
	
	Если УзелУстройства.ПометкаУдаления 
		ИЛИ УзелУстройства.Отключено 
		ИЛИ УзелУстройства = ПланыОбмена.ОбменСМобильнымиУстройствами.ЭтотУзел() Тогда
		
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Обмен с устройством запрещен.";
		
	ИначеЕсли ВерсияПриложения <> ПолучитьПоследнююВерсиюМобильногоПриложения() Тогда
		
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Установлена старая версия. Обновите приложение.";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПоследнююВерсиюМобильногоПриложения()
	
	Версия = Константы.ВерсияМобильногоПриложения.Получить();
	
	Если Версия = Неопределено Тогда
		Версия  = "1.1";
	КонецЕсли;	
	
	Возврат Версия;

КонецФункции

Функция ПроверитьОдноразовыйПароль(СтруктураОтвета, ОдноразовыйПароль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОдноразовыеПароли.СрокДействия
		|ИЗ
		|	РегистрСведений.ОдноразовыеПароли КАК ОдноразовыеПароли
		|ГДЕ
		|	ОдноразовыеПароли.ОдноразовыйПароль = &ОдноразовыйПароль";

	Запрос.УстановитьПараметр("ОдноразовыйПароль", ОдноразовыйПароль);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.СрокДействия < ТекущаяДата() Тогда
			СтруктураОтвета.Отказ = Истина;
			СтруктураОтвета.ИнформацияОбОшибке = "Указанный пароль устарел, запросите новый пароль.";
		Иначе
			// Все проверки прошли
			СтруктураОтвета.Отказ = Ложь;
		КонецЕсли;
	Иначе
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Указан неверный пароль.";
	КонецЕсли;

	
КонецФункции

Функция СоздатьПланОбменаДляМобильногоУстройства(СтруктураОтвета, ИнформацияОбУстройстве, ВладелецУстройства) Экспорт
	
	ПланОбменаОбъект = ПланыОбмена.ОбменСМобильнымиУстройствами.СоздатьУзел();
	ПланОбменаОбъект.УстановитьНовыйКод();
	//ЗаполнитьЗначенияСвойств(ПланОбменаОбъект, ИнформацияОбУстройстве, , "НомерОтправленного, НомерПринятого");
	// Я умышленно не использую ЗаполнитьЗначенияСвойств, так как неизвестно, что могут нам отправить из внешних данных
	// Отправят, например, НомерОтправленного - и весь обмен поломается.
	ПланОбменаОбъект.Наименование 			= Строка(ВладелецУстройства);
	ПланОбменаОбъект.ВладелецУстройства		= ВладелецУстройства;
	ПланОбменаОбъект.ВерсияОС				= ИнформацияОбУстройстве.ВерсияОС;
	ПланОбменаОбъект.ВерсияПриложения		= ИнформацияОбУстройстве.ВерсияПриложения;
	ПланОбменаОбъект.ИдентификаторКлиента	= ИнформацияОбУстройстве.ИдентификаторКлиента;
	ПланОбменаОбъект.ОперативнаяПамять		= ИнформацияОбУстройстве.ОперативнаяПамять;
	ПланОбменаОбъект.Процессор				= ИнформацияОбУстройстве.Процессор;
	ПланОбменаОбъект.ВысотаЭкрана			= ИнформацияОбУстройстве.ВысотаЭкрана;
	ПланОбменаОбъект.ШиринаЭкрана			= ИнформацияОбУстройстве.ШиринаЭкрана;
	ПланОбменаОбъект.РазрешениеЭкрана		= ИнформацияОбУстройстве.РазрешениеЭкрана;
	ПланОбменаОбъект.ДиагональЭкрана		= ИнформацияОбУстройстве.ДиагональЭкрана;
	Попытка
		ПланОбменаОбъект.Записать();
	Исключение
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Возникла непредвиденная ошибка на сервере при регистрации устройства (не удалось создать план обмена). Обратитесь к администратору.";
		Возврат Неопределено;
	КонецПопытки;
	
	ФизЛицоОбъект = ВладелецУстройства.ПолучитьОбъект();
	ФизЛицоОбъект.МобильныйАгент = Истина;
	ФизЛицоОбъект.ПараметрыМобильногоАгента = ПланОбменаОбъект.Ссылка;
	Попытка
		ФизЛицоОбъект.ОбменДанными.Загрузка = Истина;
		ФизЛицоОбъект.Записать();
	Исключение
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Возникла непредвиденная ошибка на сервере при регистрации устройства (не удалось закрепить устройство за физ. лицом). Обратитесь к администратору.";
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ПланОбменаОбъект.Ссылка;
	
КонецФункции

Функция ПолучитьУзелУстройства(СтруктураОтвета, ИдентификаторУстройства, ИдентификаторПланаОбмена) Экспорт
	
	Если СтрДлина(ИдентификаторПланаОбмена) <> 36 Тогда
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Полученный идентификатор плана обмена не соответствует ожидаемому.";
		Возврат Неопределено;
	КонецЕсли;
	                                             
	Попытка
		УИДПланаОбмена = Новый УникальныйИдентификатор(ИдентификаторПланаОбмена);
	Исключение
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Не удалось сформировать идентификатор плана обмена.";
		Возврат Неопределено;
	КонецПопытки;
	
	ПланОбменаСсылка = ПланыОбмена.ОбменСМобильнымиУстройствами.ПолучитьСсылку(УИДПланаОбмена);
	Если ПланОбменаСсылка.ПолучитьОбъект() = Неопределено Тогда
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Устройство не зарегистрировано в базе данных. Пройдите регистрацию заново.";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПланОбменаСсылка.ИдентификаторКлиента <> ИдентификаторУстройства Тогда
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Идентификатор устройства не соответствует ожидаемому. Пройдите регистрацию заново.";
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПланОбменаСсылка;
	
КонецФункции

Процедура УдалитьРегистрациюИзменений(УзелУстройства) Экспорт
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелУстройства);
	
КонецПроцедуры

Функция ПолучитьАктуальныеУстройстваФизЛица(ФизЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменСМобильнымиУстройствами.Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСМобильнымиУстройствами КАК ОбменСМобильнымиУстройствами
		|ГДЕ
		|	ОбменСМобильнымиУстройствами.ВладелецУстройства = &ВладелецУстройства
		|	И НЕ ОбменСМобильнымиУстройствами.Отключено";

	Запрос.УстановитьПараметр("ВладелецУстройства", ФизЛицо);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура АрхивироватьАктуальныеУстройстваФизЛица(ФизЛицо) Экспорт
	
	МассивУстройств = ПолучитьАктуальныеУстройстваФизЛица(ФизЛицо);
	Для Каждого ПланСсылка Из МассивУстройств Цикл
		АрхивироватьУстройство(ПланСсылка)
	КонецЦикла;
	
КонецПроцедуры

Процедура АрхивироватьУстройство(Ссылка) Экспорт
	
	ПланОбъект = Ссылка.ПолучитьОбъект();
	ПланОбъект.Отключено = Истина;
	Попытка
		ПланОбъект.Записать();
	Исключение
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	УдалитьРегистрациюИзменений(Ссылка);
	
КонецПроцедуры

Процедура ОбменДаннымиОбменСМобильнымиУстройствамиПередЗаписьюРегистраПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Исполнитель = ПланыОбмена.ОбменСМобильнымиУстройствами.ПустаяСсылка();
	ПредыдущийИсполнитель = ПланыОбмена.ОбменСМобильнымиУстройствами.ПустаяСсылка();
	
	Если Источник.Количество() > 0 Тогда
		Исполнитель = Источник[0].Исполнитель;
		ПланыОбмена.ЗарегистрироватьИзменения(Исполнитель, Источник);
	КонецЕсли;
	
	Если Замещение Тогда
		// Получим исполнителя по предыдущему набору, чтобы отправить информацию о неактуальности задания
		ПредыдущийНабор = РегистрыСведений.ЗаданияНаСнятиеПоказанийПриборовУчета.СоздатьНаборЗаписей();
//{{MRG[ <-> ]
		//ПредыдущийНабор.Отбор.Регистратор.Установить(Источник.Отбор.Регистратор.Значение);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		ПредыдущийНабор.Отбор.Регистратор.Установить(Источник.Отбор.Регистратор.Значение);
//}}MRG[ <-> ]
		ПредыдущийНабор.Прочитать();
		Если ПредыдущийНабор.Количество() > 0 Тогда
			ПредыдущийИсполнитель = ПредыдущийНабор[0].Исполнитель;
			Если ПредыдущийИсполнитель <> Исполнитель Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(ПредыдущийИсполнитель, ПредыдущийНабор);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
